_posts/2015-01-14-Git-Source-Code-Learn.html
---
layout: post
title: Git Source Code Learn
tag: [C, Git]
description: [I am a git fan. I am trying to hack the source code]
---

<p>
(持续更新)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">1. First step</h2>
<div class="outline-text-2" id="text-1">
<p>
get git code : git clone <a href="https://github.com/git/git">https://github.com/git/git</a>;
checkout to version 1.0: git checkout v1.0.0
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2. 2015/01/14</h2>
<div class="outline-text-2" id="text-2">
<p>
checkout to the oldest commit, just wanna see the linus-code-style
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">2.1 cache.h</h3>
<div class="outline-text-3" id="text-2-1">
<p>
defines the cache_header, cache_time, and cache_entry.
</p>
<ul class="org-ul">
<li>cache_header: defines the <b>signature</b>, <b>version</b>, <b>entries</b> and <b>shal</b>.
</li>
<li>cache_time: define the <b>sec</b> and <b>nsec</b>.
</li>
<li>cache_entry: define the entry, including <b>gid</b>, <b>uid</b>, <b>size</b>&#x2026;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">2.2 Makefile</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I don't find the <b>git</b> prog in the makefile, only some small programs.
These programs will be installed to bin after build.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">2.3 read-cache.c</h3>
<div class="outline-text-3" id="text-2-3">
<p>
这个文件其他大多文件使用, 该文件定义了很多基本的函数:
</p>
<ol class="org-ol">
<li>hexval() 用于将十六进制转换为整数.
</li>
<li>get_sha1_hex()用于将长度为40的 SHA1(160位)的十六进制表示转换为一个 无符号字符数组.
</li>
<li>sha1_to_hex()将长度为20的字符数组转换为 hex 字符串.
</li>
<li>sha1_file_name()参数为一个表示 sha1的字符数组, 返回值是一个路径, 路径的格式为
"DEFAULT_DB_ENV/A/B", 其中 A 是 sha1的 HEX 字符串的前两个字符,B 是剩下的18个字符.
很酷的生成路径的算法, 透过(i&gt;0)跳过了第二个"/";
</li>
</ol>

<div class="org-src-container">

<pre class="src src-c">for (i = 0; i &lt; 20; i++) {
	static char hex[] = "0123456789abcdef";
	unsigned int val = sha1[i];
	char *pos = name + i*2 + (i &gt; 0);
	*pos++ = hex[val &gt;&gt; 4];
	*pos = hex[val &amp; 0xf];
}
</pre>
</div>

<ol class="org-ol">
<li>read_sha1_file()用于将4中的路径中的文件内容读到 buffer 中,并返回 buffer.
这个文件是一个压缩文件, 所以通过 mmap 将文件映射到 memory 中后(这时可以关掉 fd), 
要初始化一个z_stream 变量. 接下来会通过将参数中传入的 type 和 size 写入 buffer 中,
并 malloc 一个 size 大小的 buffer,然后将从文件中读出的内容 copy 到 buffer 中,并返回 buf.
</li>
<li>write_sha1_file()将 len 大小的 buf 写入到 zlib 格式的压缩文件中.
函数刚开始先通过 deflateInit()/deflateBound()函数将 buf 压缩到 size 大小的 compressed 指向的 buffer 中, 
然后通过OpenSSL 的 SHA1_Init()/SHA1_Update()/SHA1_Final() 函数 基于 compressed生成
SHA1值,最后调用 write_sha1_buffer() 将压缩内容写入 SHA1表示的文件中.
</li>
<li>write_sha1_buffer()将压缩后的 buffer 写入 SHA1表示的文件中.
</li>
<li>verify_hdr()用来检查 cache_header 变量是否合法, 检查的内容包括: signature, version, 
基于 header 生成的 SHA1值与 header的 SHA1变量是否相等.
</li>
<li>read_cache()核心工作:
<ul class="org-ul">
<li>打开".dircache/index", mmap 到内存, 并检测 内存 是否合法.
</li>
<li>从 hdr 中取出 entry 数量和需要分配的数量, 然后 calloc 需分配量个 cache_entry指针.
</li>
<li>遍历*内存*, 找出所有的 entry,然后存到  指针数组中.
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">2.4 init-db.c</h3>
<div class="outline-text-3" id="text-2-4">
<p>
该文件只有一个 main()函数,做的主要工作:
</p>
<ul class="org-ul">
<li>创建目录".dircache"
</li>
<li>如果没定义 DB_ENVIROMENT, 使用默认的变量".dircache/object", 并在该目录下创建"0~FF"256个子目录.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">2.5 show-diff.c</h3>
<div class="outline-text-3" id="text-2-5">
<p>
该文件会编译为 show-diff 命令,文件主要包含三个函数:
</p>
<ul class="org-ul">
<li>main(), 主要工作:调用 read_cache()函数,遍历 获得的 cache_entry, 判断该 entry 的内容是否
有变, 如果有变化, 调用 read_sha1_file()获取文件, 然后调用 show_differences()显示变化.
</li>
<li>match_stat():  用 stat() 函数获取 cache_entry 指向的文件,然后与 cache_entry 中缓存的相应
stat 信息做对比,如果有变化,则表示文件有变化.
</li>
<li>show_differences():调用 "diff -u - name" 显示变化
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">3. Git tips</h2>
<div class="outline-text-2" id="text-3">
<p>
master=HEAD, stage, workspace, three big parts of git
</p>

<ol class="org-ol">
<li>git checkout tag : check out a know tag
</li>
<li>git tag : check the tags of current project
</li>
<li>git config &#x2013;global :         modify "~/.gitconfig" 
&#x2013;local :         modify "workspace/.git/config
&#x2013;system :        modify "/etc/gitconfig"
&#x2013;unset &#x2013;global/local/system : "delete the related config"
</li>
<li>git init dirname : create a repository named dirname
</li>
<li>git commit &#x2013;amend para : modify the latest commit
</li>
<li>git log        &#x2013;commit : show the file detail changes of the commit
&#x2013;pretty=oneline : a oneline log with magic number and log mesg
&#x2013;pretty=raw : show a full detail info of a commit record
&#x2013;graph : show a tree format of commit
</li>
<li>git diff                  : compare workspace with stage 
&#x2013;cached : compare stage with repo
 HEAD         : compare workspace with repo
</li>
<li>git reset HEAD : stage will be recovered by master, not affect workspace
</li>
<li>git checkout &#x2013; file : file change in workspace will be covered, stage c
                   content not change
HEAD &lt;file&gt; : file in stage and workspace all be covered
</li>
<li>git clean -fd : clean all the files and dirs not add to repo. 
</li>
<li>git ls -l HEAD : show HEAD tree
-s :                 show stage tree
</li>
<li>git stash : temporily saved the workspace, where will become clean after exec this command
</li>
<li>git cat-file -t magicnumber : check the type of magic number
-p magicnumber : check the content of the magic number
</li>
<li>git clone repo tag
</li>
<li>change the default editor: git config &#x2013;global core.editor "vim"
</li>
<li>get the ".git" position: git rev-parse &#x2013;git-dir
</li>
<li>git commit &#x2013;amend: modify last commit, no commit a new one
</li>
<li>how to check out files from a bare repo
cat .git/packed-refs, checkout the files from the SHA1 hash number
</li>
</ol>

<p>
How to get all from ftp server?
A: wget <a href="ftp://xxx.xx7.xxx.xx/">ftp://xxx.xx7.xxx.xx/</a>* &#x2013;ftp-user=xxxxxxxxxxxxxxxxxxxx &#x2013;ftp-password=xxxxxxxx -r
</p>
</div>
</div>
